# Find all records with words that start with the letter 'g'

Find all records with words that start with the letter 'g'.

Output words1 and words2 if any of them satisfies the condition.

In [33]:
import pandas as pd
import numpy as np
q=pd.read_csv('google_word_lists.csv')
q

                      words1                 words2
0  google,facebook,microsoft      flower,nature,sun
1                 sun,nature           google,apple
2                beach,photo  facebook,green,orange
3                flower,star       photo,sunglasses

In [34]:
# concatenate 2 columns into a series
pd.concat([q.words1,q.words2])

0    google,facebook,microsoft
1                   sun,nature
2                  beach,photo
3                  flower,star
0            flower,nature,sun
1                 google,apple
2        facebook,green,orange
3             photo,sunglasses
dtype: object

In [35]:
# create a dataframe
q=pd.DataFrame(pd.concat([q.words1,q.words2])).rename(columns={0:'content'})
q

                     content
0  google,facebook,microsoft
1                 sun,nature
2                beach,photo
3                flower,star
0          flower,nature,sun
1               google,apple
2      facebook,green,orange
3           photo,sunglasses

In [36]:
# combine all values into a varriable
content=q.content.str.cat(sep=',')
content

'google,facebook,microsoft,sun,nature,beach,photo,flower,star,flower,nature,sun,google,apple,facebook,green,orange,photo,sunglasses'

In [37]:
# split into a signle word byb separator ','
content=content.split(',')
content

['google',
 'facebook',
 'microsoft',
 'sun',
 'nature',
 'beach',
 'photo',
 'flower',
 'star',
 'flower',
 'nature',
 'sun',
 'google',
 'apple',
 'facebook',
 'green',
 'orange',
 'photo',
 'sunglasses']

In [31]:
# reset a dataframe which contains all singgle words
q=pd.DataFrame(content).rename(columns={0:'content'})
q

            content
0            google
1          facebook
2   microsoftflower
3            nature
4               sun
5               sun
6      naturegoogle
7             apple
8             beach
9     photofacebook
10            green
11           orange
12           flower
13        starphoto
14       sunglasses

In [22]:
# find the word start with 'g'
q[q.content.str.startswith('g')]

   content
0   google
12  google
15   green